In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01  0.877121  0.667935  0.276246  1.014461
2013-01-02 -0.210399  1.451278  1.234640 -0.353831
2013-01-03 -2.020628 -0.188404 -0.895279 -0.617752
2013-01-04 -1.117497  1.719689  0.952008  1.431147
2013-01-05  1.199456 -0.337094  1.549357  1.505316
2013-01-06 -1.093920 -0.524423  0.189102 -1.477324

In [10]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
print(df2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df2.align

<bound method DataFrame.align of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [13]:
df.head(2)

                   A         B         C         D
2013-01-01  0.877121  0.667935  0.276246  1.014461
2013-01-02 -0.210399  1.451278  1.234640 -0.353831

In [14]:
df.tail(1)

                  A         B         C         D
2013-01-06 -1.09392 -0.524423  0.189102 -1.477324

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df

                   A         B         C         D
2013-01-01  0.877121  0.667935  0.276246  1.014461
2013-01-02 -0.210399  1.451278  1.234640 -0.353831
2013-01-03 -2.020628 -0.188404 -0.895279 -0.617752
2013-01-04 -1.117497  1.719689  0.952008  1.431147
2013-01-05  1.199456 -0.337094  1.549357  1.505316
2013-01-06 -1.093920 -0.524423  0.189102 -1.477324

In [17]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [18]:
df.to_numpy()

array([[ 0.87712059,  0.6679346 ,  0.27624623,  1.01446057],
       [-0.21039927,  1.45127802,  1.23464026, -0.35383139],
       [-2.0206278 , -0.18840447, -0.89527944, -0.61775229],
       [-1.11749705,  1.71968867,  0.95200768,  1.43114659],
       [ 1.19945615, -0.33709387,  1.54935656,  1.50531551],
       [-1.09392038, -0.52442342,  0.18910186, -1.47732392]])

In [19]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.394311  0.464830  0.551012  0.250336
std    1.252822  0.963060  0.885785  1.237463
min   -2.020628 -0.524423 -0.895279 -1.477324
25%   -1.111603 -0.299922  0.210888 -0.551772
50%   -0.652160  0.239765  0.614127  0.330315
75%    0.605241  1.255442  1.163982  1.326975
max    1.199456  1.719689  1.549357  1.505316

In [21]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.877121   -0.210399   -2.020628   -1.117497    1.199456   -1.093920
B    0.667935    1.451278   -0.188404    1.719689   -0.337094   -0.524423
C    0.276246    1.234640   -0.895279    0.952008    1.549357    0.189102
D    1.014461   -0.353831   -0.617752    1.431147    1.505316   -1.477324

In [22]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01  0.877121  0.667935  0.276246  1.014461
2013-01-02 -0.210399  1.451278  1.234640 -0.353831
2013-01-03 -2.020628 -0.188404 -0.895279 -0.617752
2013-01-04 -1.117497  1.719689  0.952008  1.431147
2013-01-05  1.199456 -0.337094  1.549357  1.505316
2013-01-06 -1.093920 -0.524423  0.189102 -1.477324

In [23]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-04 -1.117497  1.719689  0.952008  1.431147
2013-01-02 -0.210399  1.451278  1.234640 -0.353831
2013-01-01  0.877121  0.667935  0.276246  1.014461
2013-01-03 -2.020628 -0.188404 -0.895279 -0.617752
2013-01-05  1.199456 -0.337094  1.549357  1.505316
2013-01-06 -1.093920 -0.524423  0.189102 -1.477324

In [24]:
df['A']

2013-01-01    0.877121
2013-01-02   -0.210399
2013-01-03   -2.020628
2013-01-04   -1.117497
2013-01-05    1.199456
2013-01-06   -1.093920
Freq: D, Name: A, dtype: float64

In [25]:
df[0:2]

                   A         B         C         D
2013-01-01  0.877121  0.667935  0.276246  1.014461
2013-01-02 -0.210399  1.451278  1.234640 -0.353831

In [26]:
df['20130102':'20130104'] #dates

                   A         B         C         D
2013-01-02 -0.210399  1.451278  1.234640 -0.353831
2013-01-03 -2.020628 -0.188404 -0.895279 -0.617752
2013-01-04 -1.117497  1.719689  0.952008  1.431147

In [27]:
df.loc[dates[2]]

A   -2.020628
B   -0.188404
C   -0.895279
D   -0.617752
Name: 2013-01-03 00:00:00, dtype: float64

In [28]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.877121  0.667935
2013-01-02 -0.210399  1.451278
2013-01-03 -2.020628 -0.188404
2013-01-04 -1.117497  1.719689
2013-01-05  1.199456 -0.337094
2013-01-06 -1.093920 -0.524423

In [29]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.210399  1.451278
2013-01-03 -2.020628 -0.188404
2013-01-04 -1.117497  1.719689

In [30]:
df.loc['20130102', ['A', 'B']]

A   -0.210399
B    1.451278
Name: 2013-01-02 00:00:00, dtype: float64

In [31]:
df.loc[dates[0], 'A']

0.8771205915564849

In [32]:
df.at[dates[0], 'A']

0.8771205915564849

In [33]:
df.iloc[0]

A    0.877121
B    0.667935
C    0.276246
D    1.014461
Name: 2013-01-01 00:00:00, dtype: float64

In [34]:
df.iloc[3:5, 0:3]

                   A         B         C
2013-01-04 -1.117497  1.719689  0.952008
2013-01-05  1.199456 -0.337094  1.549357

In [35]:
df

                   A         B         C         D
2013-01-01  0.877121  0.667935  0.276246  1.014461
2013-01-02 -0.210399  1.451278  1.234640 -0.353831
2013-01-03 -2.020628 -0.188404 -0.895279 -0.617752
2013-01-04 -1.117497  1.719689  0.952008  1.431147
2013-01-05  1.199456 -0.337094  1.549357  1.505316
2013-01-06 -1.093920 -0.524423  0.189102 -1.477324

In [36]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.210399  1.234640
2013-01-03 -2.020628 -0.895279
2013-01-05  1.199456  1.549357

In [37]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.210399  1.451278  1.234640 -0.353831
2013-01-03 -2.020628 -0.188404 -0.895279 -0.617752

In [38]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.667935  0.276246
2013-01-02  1.451278  1.234640
2013-01-03 -0.188404 -0.895279
2013-01-04  1.719689  0.952008
2013-01-05 -0.337094  1.549357
2013-01-06 -0.524423  0.189102

In [39]:
df.iloc[0, 0]

0.8771205915564849

In [40]:
df

                   A         B         C         D
2013-01-01  0.877121  0.667935  0.276246  1.014461
2013-01-02 -0.210399  1.451278  1.234640 -0.353831
2013-01-03 -2.020628 -0.188404 -0.895279 -0.617752
2013-01-04 -1.117497  1.719689  0.952008  1.431147
2013-01-05  1.199456 -0.337094  1.549357  1.505316
2013-01-06 -1.093920 -0.524423  0.189102 -1.477324

In [41]:
df.iat[0, 0]

0.8771205915564849

In [42]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  0.877121  0.667935  0.276246  1.014461
2013-01-05  1.199456 -0.337094  1.549357  1.505316

In [43]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.877121  0.667935  0.276246  1.014461
2013-01-02       NaN  1.451278  1.234640       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04       NaN  1.719689  0.952008  1.431147
2013-01-05  1.199456       NaN  1.549357  1.505316
2013-01-06       NaN       NaN  0.189102       NaN

In [44]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.877121  0.667935  0.276246  1.014461    one
2013-01-02 -0.210399  1.451278  1.234640 -0.353831    one
2013-01-03 -2.020628 -0.188404 -0.895279 -0.617752    two
2013-01-04 -1.117497  1.719689  0.952008  1.431147  three
2013-01-05  1.199456 -0.337094  1.549357  1.505316   four
2013-01-06 -1.093920 -0.524423  0.189102 -1.477324  three

In [45]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [46]:
df['F'] = s1

In [47]:
df.at[dates[0], 'A'] = 0

In [48]:
df.iat[0, 1] = 0

In [49]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [50]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.276246  5  NaN
2013-01-02 -0.210399  1.451278  1.234640  5  1.0
2013-01-03 -2.020628 -0.188404 -0.895279  5  2.0
2013-01-04 -1.117497  1.719689  0.952008  5  3.0
2013-01-05  1.199456 -0.337094  1.549357  5  4.0
2013-01-06 -1.093920 -0.524423  0.189102  5  5.0

In [51]:
df2 = df.copy()

In [52]:
df2[df2 > 0] = -df2

In [53]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.276246 -5  NaN
2013-01-02 -0.210399 -1.451278 -1.234640 -5 -1.0
2013-01-03 -2.020628 -0.188404 -0.895279 -5 -2.0
2013-01-04 -1.117497 -1.719689 -0.952008 -5 -3.0
2013-01-05 -1.199456 -0.337094 -1.549357 -5 -4.0
2013-01-06 -1.093920 -0.524423 -0.189102 -5 -5.0

In [54]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [55]:
df1.loc[dates[0]:dates[1], 'E'] = 1